emacs/.spacemacs.d/spacemacs.org
#+TITLE: Spacemacs tangled user configuration
#+STARTUP: headlines
#+STARTUP: nohideblocks
#+STARTUP: noindent
#+OPTIONS: toc:4 h:4
#+PROPERTY: header-args:emacs-lisp :comments link
* Spacecmacs の設定を org-mode で管理する
** .spacemacs を削除する
=~/.spacemacs= は =~/.spacemacs.d/init.el= よりも優先度が高いので， =~/.spacemacs= は削除しておく。
- [[https://www.spacemacs.org/doc/DOCUMENTATION.html#alternative-dotdirectory]]
** 参考にしたもの
- [[https://www.reddit.com/r/emacs/comments/7ntc6p/spacemacs_configuration_in_a_structured_orgmode/]]
** .spacemacs.d/init.el
    #+begin_src emacs-lisp :tangle no
      (defun dotspacemacs/user-init ()
      ;; tangle without actually loading org
      (let ((src (concat dotspacemacs-directory "spacemacs.org"))
          (ui (concat dotspacemacs-directory "user-init.el"))
          (uc (concat dotspacemacs-directory "user-config.el")))
      (when (or (file-newer-than-file-p src ui)
                (file-newer-than-file-p src uc))
        (call-process
         (concat invocation-directory invocation-name)
         nil nil t
         "-q" "--batch" "--eval" "(require 'ob-tangle)"
         "--eval" (format "(org-babel-tangle-file \"%s\")" src)))
      (load-file ui)))


      (defun dotspacemacs/user-config ()
        (let ((uc (concat dotspacemacs-directory "user-config.el")))
          (load-file uc)))
    #+end_src
* 基本設定
** 行番号を表示
    #+begin_src emacs-lisp :tangle user-init.el
      (global-linum-mode t)
    #+end_src
** 画面透過
    #+begin_src emacs-lisp :tangle user-init.el
      (if window-system (progn
          (set-frame-parameter nil 'alpha 90) ;透明度
          ))
    #+end_src
** spacemacs テーマ
- [[https://themegallery.robdor.com/]]
    #+begin_src emacs-lisp :tangle user-init.el
      (setq-default dotspacemacs-themes '(deeper-blue))
    #+end_src
* 日本語入力の設定
** +MEPLA 経由で DDSKK を追加する+
+init.el に =dotspacemacs-additional-packages '(ddskk)= を追加+
   +- 参照：[[ https://www.spacemacs.org/doc/DOCUMENTATION.html#orgheadline21]]+
** spacemacs japanse layer を使う
- Japanese layer:  [[https://github.com/syl20bnr/spacemacs/tree/develop/layers/%2Bintl/japanese]] 
*** ~/.emacs.d/
    #+begin_src shell :tangle no
      git checkout develop
      git pull origin develop
    #+end_src
- =~/.spacemacs.d/init.el= の =dotspacemacs-configuration-layer= に =japanse= と追加
** cmigemo をインストール
- cmigemo: [[https://github.com/koron/cmigemo]]
    #+begin_src shell :tanlge no
      apt install cmigemo
    #+end_src
** migemo の設定 
- migemo: [[https://github.com/emacs-jp/migemo]]

** DDSKK のデフォルト化とキーバインディング・句読点
- DDSKK: [[https://ddskk.readthedocs.io/ja/latest/index.html]]
    #+begin_src emacs-lisp :tangle user-init.el
      (global-set-key "\C-x\C-j" 'skk-mode)
      (global-set-key "\C-xj" 'skk-auto-fill-mode)
      (global-set-key "\C-xt" 'skk-tutorial)

      (setq default-input-method "japanese-skk")

      (setq-default skk-kutouten-type 'jp-en)
    #+end_src
** 設定ファイルを =~/.ddskk= にまとめる
    #+begin_src emacs-lisp :tangle user-init.el
      (setq skk-user-directory "~/.ddskk")
    #+end_src
* Org-mode
** org-tempo を読み込む 
    #+begin_src emacs-lisp :tangle user-config.el
      (when (version<= "9.2" (org-version))
       (require 'org-tempo))
    #+end_src 
** ox-hugo
- [[ox-hugo: https://ox-hugo.scripter.co/]]
    #+begin_src emacs-lisp :tangle user-config.el
      (use-package ox-hugo
        :ensure t
        :after ox)
    #+end_src
* EWW
- EWW: [[https://www.gnu.org/software/emacs/manual/html_mono/eww.html]]
** 新しい EWW バッファの名前を自動的に変更
- [[https://emacs.stackexchange.com/questions/24472/simple-method-for-creating-multiple-eww-buffers]]
- [[http://ergoemacs.org/emacs/emacs_eww_web_browser.html]]
   #+begin_src emacs-lisp :tangle user-init.el
     (defun xah-rename-eww-hook ()
       "Rename eww browser's buffer so sites open in new page."
       (rename-buffer "eww" t))
     (add-hook 'eww-mode-hook #'xah-rename-eww-hook)
   #+end_src
